In [1]:
import pandas as pd
import numpy as np

In [3]:
data =pd.read_csv('C:\\Users\\Dilan\\Desktop\\lotto\\cleaned_data.csv')
data

      Draw/Date Results
0        1751.0       N
1           NaN      11
2           NaN      16
3           NaN      20
4           NaN      53
...         ...     ...
2354     1539.0       Z
2355        NaN      13
2356        NaN      53
2357        NaN      65
2358        NaN      72

[2359 rows x 2 columns]

In [4]:
data.head(10)

   Draw/Date Results
0     1751.0       N
1        NaN      11
2        NaN      16
3        NaN      20
4        NaN      53
5     1750.0       X
6        NaN      27
7        NaN      43
8        NaN      48
9        NaN      65

In [5]:
# Remove rows where both columns are NaN
data1 = data.dropna(how='all', subset=['Draw/Date', 'Results'])

print(data1)

      Draw/Date Results
0        1751.0       N
1           NaN      11
2           NaN      16
3           NaN      20
4           NaN      53
...         ...     ...
2354     1539.0       Z
2355        NaN      13
2356        NaN      53
2357        NaN      65
2358        NaN      72

[1065 rows x 2 columns]

In [6]:
data1.head(20)

    Draw/Date Results
0      1751.0       N
1         NaN      11
2         NaN      16
3         NaN      20
4         NaN      53
5      1750.0       X
6         NaN      27
7         NaN      43
8         NaN      48
9         NaN      65
16     1749.0       O
17        NaN      17
18        NaN      26
19        NaN      47
20        NaN      56
26     1748.0       M
27        NaN       9
28        NaN      18
29        NaN      52
30        NaN      75

: